tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Command-line tool for Codeforces contests
brew "cf-tool"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Emacs text editor
brew "emacs"
# Modern replacement for 'ls'
brew "exa"
# Distributed revision control system
brew "git", link: false
# Multi-platform library for OpenGL applications
brew "glfw"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# Mac App Store command-line interface
brew "mas"
# Official Monero wallet and CPU miner
brew "monero"
# Open source relational database management system
brew "mysql"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Platform built on V8 to build network applications
brew "node"
# Optimized BLAS library
brew "openblas"
# General-purpose scripting language
brew "php"
# Web interface for MySQL and MariaDB
brew "phpmyadmin"
# Object-relational database system
brew "postgresql@14"
# Software environment for statistical computing
brew "r"
# Rust toolchain installer
brew "rustup-init"
# Anonymizing overlay network for TCP
brew "tor"
# Language for application scale JavaScript development
brew "typescript"
# Memory training application
cask "anki"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Cryptocurrency exchange
cask "binance"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Desktop wallet for cryptocurrency assets
cask "exodus"
# Web browser
cask "firefox"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Free and open-source image editor
cask "gimp"
# Git client focusing on productivity
cask "gitkraken"
# Password manager app
cask "keepassxc"
# Instant shortcut lookup
cask "keycombiner"
# Sandbox construction video game
cask "minecraft"
# Web browser focused on privacy and on minimizing tracking and fingerprinting
cask "mullvad-browser"
# VPN client
cask "mullvadvpn"
# App to write, plan, collaborate, and get organized
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# Finds large, unwanted files and deletes them
cask "omnidisksweeper"
# Free-to-play online poker
cask "pokerstars"
# Collaboration platform for API development
cask "postman"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Text editor for code, markup and prose
cask "sublime-text"
# Web browser focusing on security
cask "tor-browser"
# Open-source code editor
cask "visual-studio-code"
# WordPress client
cask "wordpresscom"
# Video communication and virtual meeting platform
cask "zoom"
mas "GarageBand", id: 682658836
mas "Hex Fiend", id: 1342896380
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "NiBoard", id: 1511409657
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Playgrounds", id: 1496833156
mas "Timetable", id: 425121147
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
mas "Yubico Authenticator", id: 1497506650
