# Zstandard is a real-time compression algorithm
brew "zstd"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern replacement for 'ls'
brew "exa"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GNU debugger
brew "gdb"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Multi-platform library for OpenGL applications
brew "glfw"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Featureful UNIX password cracker
brew "john"
# Image processing and image analysis library
brew "leptonica"
# Library for encoding and decoding .avif files
brew "libavif"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql"
# Open source relational database management system
brew "mysql-client"
# Utility for managing network connections
brew "netcat"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Object-relational database system
brew "postgresql@14"
# Software environment for statistical computing
brew "r"
# Command-line Kanban board/task manager with support for Trello
brew "taskell"
# User interface to the TELNET protocol
brew "telnet"
# Anonymizing overlay network for TCP
brew "tor"
# Memory training application
cask "anki"
# Electronics prototyping platform
cask "arduino"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Online diagram software
cask "drawio"
# Web browser
cask "firefox"
cask "font-hack-nerd-font"
# Solve, save and share math problems, graph functions, etc
cask "geogebra"
# Free and open-source image editor
cask "gimp"
# Instant shortcut lookup
cask "keycombiner"
# Sandbox construction video game
cask "minecraft"
# VPN client
cask "mullvadvpn"
# App to write, plan, collaborate, and get organised
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# Finds large, unwanted files and deletes them
cask "omnidisksweeper"
# Free-to-play online poker
cask "pokerstars"
# Collaboration platform for API development
cask "postman"
# Modern programming language in the Lisp/Scheme family
cask "racket"
# Data science software focusing on R and Python
cask "rstudio"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Text editor for code, markup and prose
cask "sublime-text"
# Web browser focusing on security
cask "tor-browser"
# Virtualiser for x86 hardware
cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
# Network protocol analyzer
cask "wireshark"
# Video communication and virtual meeting platform
cask "zoom"
mas "AdGuard for Safari", id: 1440147259
mas "Developer", id: 640199958
mas "Endel", id: 1346247457
mas "GarageBand", id: 682658836
mas "Hex Fiend", id: 1342896380
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Playgrounds", id: 1496833156
mas "Streaks", id: 963034692
mas "TestFlight", id: 899247664
mas "Transporter", id: 1450874784
mas "Xcode", id: 497799835
mas "‎WhatsApp", id: 310633997
