# Zstandard is a real-time compression algorithm
brew "zstd"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# C parser in Python
brew "pycparser"
# Text processing system for reStructuredText
brew "docutils"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Command-line tool for Codeforces contests
brew "cf-tool"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern replacement for 'ls'
brew "exa"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# GNU compiler collection
brew "gcc"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# GNU debugger
brew "gdb"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Multi-platform library for OpenGL applications
brew "glfw"
# Improved top (interactive process viewer)
brew "htop"
# Postgres C API library
brew "libpq"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql"
# Fast, highly customisable system info script
brew "neofetch"
# Utility for managing network connections
brew "netcat"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Optimized BLAS library
brew "openblas"
# Object-relational database system
brew "postgresql@14"
# Software environment for statistical computing
brew "r"
# Command-line Kanban board/task manager with support for Trello
brew "taskell"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Anonymizing overlay network for TCP
brew "tor"
# Memory training application
cask "anki"
# Electronics prototyping platform
cask "arduino"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Online diagram software
cask "drawio"
# Web browser
cask "firefox"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Solve, save and share math problems, graph functions, etc
cask "geogebra"
# Free and open-source image editor
cask "gimp"
# Instant shortcut lookup
cask "keycombiner"
# Digital logic designer and simulator
cask "logisim-evolution"
# Sandbox construction video game
cask "minecraft"
# VPN client
cask "mullvadvpn"
# App to write, plan, collaborate, and get organized
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# Finds large, unwanted files and deletes them
cask "omnidisksweeper"
# Free-to-play online poker
cask "pokerstars"
# Collaboration platform for API development
cask "postman"
# Data science software focusing on R and Python
cask "rstudio"
# Music streaming service
cask "spotify"
# Text editor for code, markup and prose
cask "sublime-text"
# Web browser focusing on security
cask "tor-browser"
# Virtualizer for x86 hardware
cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
mas "AdGuard for Safari", id: 1440147259
mas "Endel", id: 1346247457
mas "GarageBand", id: 682658836
mas "Hex Fiend", id: 1342896380
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Playgrounds", id: 1496833156
mas "‎WhatsApp", id: 310633997
